app/controllers/features_controller.rb

  def index
    @features = Feature.all
---
SELECT "features".* FROM "features"

  def show
    @feature = Feature.find(params[:id])
---
SELECT "features".* FROM "features" WHERE "features"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save
---
INSERT INTO "features" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 04 Jun 2013 20:54:15 UTC +00:00], ["nombre", "huevos"], ["updated_at", Tue, 04 Jun 2013 20:54:15 UTC +00:00]]