app/controllers/gas_stations_controller.rb

SELECT "gas_stations".* FROM "gas_stations"
---
  def index
    @gas_stations = GasStation.all

SELECT "gas_stations".* FROM "gas_stations" WHERE "gas_stations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @gas_station = GasStation.find(params[:id])

SELECT "features".* FROM "features"
---
  def new
    @gas_station = GasStation.new

    @features = Feature.all

INSERT INTO "gas_stations" ("created_at", "direccion", "foto1", "latitud", "longitud", "nombre", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gas_station = GasStation.new(params[:gas_station])

    #@features = Feature.find(params[:feature])
    if params["features"] != nil
      params["features"].each do |feature|
        f = Feature.find(feature)
        @gas_station.features << f